Revit 2024 API
ViewActivatedEventArgs Class
 The event arguments used by the ViewActivated event.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2010
Syntax
C#
public class ViewActivatedEventArgs : RevitAPIPostDocEventArgs
Visual Basic
Public Class ViewActivatedEventArgs _
	Inherits RevitAPIPostDocEventArgs
Visual C++
public ref class ViewActivatedEventArgs : public RevitAPIPostDocEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.UI.Events.ViewActivatedEventArgs
See Also
ViewActivatedEventArgs Members
Autodesk.Revit.UI.Events Namespace